In [1]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [15]:
import pandas as pd
data = [4,8,15,16,23,42]
dataframe = pd.DataFrame(data)

In [16]:
type(dataframe)

pandas.core.frame.DataFrame

In [17]:
dataframe

    0
0   4
1   8
2  15
3  16
4  23
5  42

In [18]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [19]:
values = [1,2,3,4,5,6,7,8,9,10]
dataF = pd.DataFrame(values)

In [20]:
dataF

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [21]:
dataF.head()

   0
0  1
1  2
2  3
3  4
4  5

In [22]:
dataF.tail()

    0
5   6
6   7
7   8
8   9
9  10

In [24]:
dataF.dtypes

0    int64
dtype: object

In [25]:
dataF.columns

RangeIndex(start=0, stop=1, step=1)

In [26]:
dataF[0]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: 0, dtype: int64

In [27]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [29]:
students = {
    'name' : ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female' ,'Male' ,'Female']
}

In [30]:
pd.DataFrame(students)

     name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [31]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [32]:
# Pandas DataFrame  are collection of multiple series , it is 2 Dimensional table which stores data in row and column formate where each column is a seriers
# pandas Series = is a 1 Dimensional table , it conists of values and index, and index starts from 0.

In [33]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [35]:
# some common functions that we can use to manipulate data in a Pandas DataFrame are -
# head(),tail(),type(),read_csv(),read_html(),to_csv(),etc.
# when we have to manipulate the data from the data frame we can check data types find first and last most values , include header or not convert to csv file etc.

In [52]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
# # All three are mutable in nature 
# 1. Series
s = [1,2,3,4]
pd.Series(s)
print("befor Modificaion Series",s)

s[2]='change'
print("After Modification Series",s)

# 1. DataFrame
d = {'values':[1,2,3,4],'square':[1,4,9,16]}
D=pd.DataFrame(d)
print("befor Modificaion DataFrame",D)

D.at[2,'values']=32
print("After Modification DataFrame",D)


# panels are mutanle and currently deprecated , nowdays uses MultiIndex dataframe or xarray in place of panels

befor Modificaion Series [1, 2, 3, 4]
After Modification Series [1, 2, 'change', 4]
befor Modificaion DataFrame    values  square
0       1       1
1       2       4
2       3       9
3       4      16
After Modification DataFrame    values  square
0       1       1
1       2       4
2      32       9
3       4      16

In [53]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
# we can make dataframe from multiple series

In [59]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series(["hey","hello"])
D1 = pd.DataFrame({"number":s1,"words":s2})

In [60]:
D1

   number  words
0       1    hey
1       2  hello
2       3    NaN
3       4    NaN